
/*
 * File:   main.c
 * Author: ICE_MEGANE
 *
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>
#include "adc.h"
#include "main.h"
#include "./userdefine.h"

#include "int.h"

/* 関数プロトタイプ宣言 */
static void func_int_s_tmr4_match( void );



/**************************************************************/
/*  Function:                                                 */
/*  割り込み処理                                               */
/*  割り込み発生時にここに来る                                  */
/*  ベクタは1コだけなので割り込みフラグを処理内で判別             */
/**************************************************************/
void __interrupt() isr( void )
{
    if( ( PIR3 & 0x02U ) != 0U )
    { /* TMR4 一致割り込み発生 */
        func_int_s_tmr4_match();
        PIR3 &= (u8)~0x02U;                         /* 割り込みフラグクリア */
    }

    if( ( PIR1 & 0x40U ) != 0U )
    { /* AD変換 完了割り込み発生 */
        func_adc_g_adc_data_get();                 /* AD変換結果格納 & 残りの変換要求を処理する */
        PIR1 &= (u8)~0x40U;                         /* 割り込みフラグクリア */
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  割り込み関連のmain-loop処理                                 */
/*                                                            */
/**************************************************************/
void func_int_g_main( void )
{
    /* 特に使う予定はない */
    /* 割り込み関連のフラグをループ側でクリアしたい場合はここで処理する */
}


/**************************************************************/
/*  Function:                                                 */
/*  割り込み関連初期化処理                                      */
/*                                                            */
/**************************************************************/
void func_int_g_init( void )
{
    ;
}



/**************************************************************/
/*  Function:                                                 */
/*  タイマ4 一致割り込みタスク                                  */
/**************************************************************/
static void func_int_s_tmr4_match( void )
{
    func_main_s_main_loop_judge();
}
